//==============================================================================
// Filename: Gfx_VertexShader.h
// Description: 頂点シェーダ処理
// Copyright (C) 2022 Silicon Studio Co., Ltd. All rights reserved.
//==============================================================================

#pragma once

//===== インクルード部 =====
#include <Gfx/Binder/Gfx_Binder.h>

//===== クラス定義 =====

//***** 頂点シェーダ *****
class GfxVertexShader : public GfxBinder
{
public:

    //--------------------------------------------------------------------------

    //--------------------------------------------------------------------------
    /// コンストラクタ
    ///
    /// \param[in] gfx      グラフィック処理の参照先
    /// \param[in] path     シェーダファイルのディレクトリ
    ///
    /// \return void
    //--------------------------------------------------------------------------
    GfxVertexShader(
        /*[in]*/ GfxMain& gfx,
        /*[in]*/ const std::wstring& path);

    //--------------------------------------------------------------------------
    /// デストラクタ
    ///
    /// \return void
    //--------------------------------------------------------------------------
    ~GfxVertexShader() noexcept override;

    //--------------------------------------------------------------------------
    /// バインド処理
    ///
    /// \param[in] gfx  グラフィック処理の参照先
    ///
    /// \return void
    //--------------------------------------------------------------------------
    void Bind(
        /*[in]*/ GfxMain& gfx) noexcept override;

    //--------------------------------------------------------------------------
    /// シェーダファイル取得
    ///
    /// \return シェーダファイルの参照
    //--------------------------------------------------------------------------
    ID3DBlob* GetBytecode() noexcept
    {
        return m_pBytecodeVS.Get();
    }

    //--------------------------------------------------------------------------

protected:

    //--------------------------------------------------------------------------
    Microsoft::WRL::ComPtr<ID3DBlob> m_pBytecodeVS;
    Microsoft::WRL::ComPtr<ID3D11VertexShader> m_pVertexShader;
    //--------------------------------------------------------------------------

    /// <summary>
    /// m_pBytecodeVS       シェーダファイル読込み用
    /// m_pVertexShader     ポインタ
    /// </summary>
};
