//==============================================================================
// Filename: Gfx_RootSignature.h
// Description: ルートシグネチャ処理
// Copyright (C) 2022 Silicon Studio Co., Ltd. All rights reserved.
//==============================================================================

#pragma once

//===== インクルード部 =====
#include <Gfx/Binder/Gfx_Binder.h>
#include <Tool/Tool_TexLoader.h>

//===== クラス定義 =====

//***** テクスチャ *****
class GfxRootSignature : public GfxBinder
{
public:

    //--------------------------------------------------------------------------

    //--------------------------------------------------------------------------
    /// コンストラクタ
    ///
    /// \param[in] gfx      グラフィック処理の参照先
    ///
    /// \return void
    //--------------------------------------------------------------------------
    GfxRootSignature(
        /*[in]*/ GfxMain& gfx);

    //--------------------------------------------------------------------------
    /// デストラクタ
    ///
    /// \return void
    //--------------------------------------------------------------------------
    ~GfxRootSignature() noexcept override;

    //--------------------------------------------------------------------------
    /// バインド処理
    ///
    /// \param[in] gfx  グラフィック処理の参照先
    ///
    /// \return void
    //--------------------------------------------------------------------------
    void Bind(
        /*[in]*/ GfxMain& gfx) noexcept override;    //バインド処理

    //--------------------------------------------------------------------------
    /// ルートシグネチャ取得
    ///
    /// \return ルートシグネチャのポインタ
    //--------------------------------------------------------------------------
    ID3D12RootSignature* GetRootSignature() const noexcept
    {
        return m_pRootSignature.Get();
    }

    //--------------------------------------------------------------------------

protected:

    //--------------------------------------------------------------------------
    Microsoft::WRL::ComPtr<ID3D12RootSignature> m_pRootSignature;
    //--------------------------------------------------------------------------

    /// <summary>
    /// m_pRootSignature    ルートシグネチャのポインタ
    /// </summary>
};
