//==============================================================================
// Filename: Gfx_Texture.h
// Description: テクスチャ処理
// Copyright (C) 2022 Silicon Studio Co., Ltd. All rights reserved.
//==============================================================================

#pragma once

//===== インクルード部 =====
#include <Gfx/Binder/Gfx_Binder.h>
#include <Tool/Tool_TexLoader.h>
#include <Gfx/Binder/Gfx_HeapMgr.h>

//===== クラス定義 =====

//***** テクスチャ *****
class GfxTexture : public GfxBinder
{
public:

    //--------------------------------------------------------------------------

    //--------------------------------------------------------------------------
    /// コンストラクタ
    ///
    /// \param[in] gfx      グラフィック処理の参照先
    /// \param[in] data     テクスチャのデータ
    /// \param[in] heapMgr  ヒープマネージャ
    /// \param[in] slot     入力スロット
    ///
    /// \return void
    //--------------------------------------------------------------------------
    GfxTexture(
        /*[in]*/ GfxMain& gfx,
        /*[in]*/ ToolTexLoader::TexData& data,
        /*[in]*/ GfxHeapMgr& heapMgr,
        /*[in]*/ UINT slot = 0u);

    //--------------------------------------------------------------------------
    /// デストラクタ
    ///
    /// \return void
    //--------------------------------------------------------------------------
    ~GfxTexture() noexcept override;

    //--------------------------------------------------------------------------
    /// バインド処理
    ///
    /// \param[in] gfx  グラフィック処理の参照先
    ///
    /// \return void
    //--------------------------------------------------------------------------
    void Bind(
        /*[in]*/ GfxMain& gfx) noexcept override;

    //--------------------------------------------------------------------------
    /// ヒープ登録
    ///
    /// \param[in] gfx      グラフィック処理の参照先
    /// \param[in] slot     入力スロット
    ///
    /// \return void
    //--------------------------------------------------------------------------
    void BindHeap(
        /*[in]*/ GfxMain& gfx,
        /*[in]*/ UINT slot);

    //--------------------------------------------------------------------------

protected:

    //--------------------------------------------------------------------------

    //--------------------------------------------------------------------------
    /// バッファ作成(DX11)
    ///
    /// \param[in] gfx  グラフィック処理の参照先
    /// \param[in] data     テクスチャのデータ
    ///
    /// \return void
    //--------------------------------------------------------------------------
    void CreateBufferDX11(
        /*[in]*/ GfxMain& gfx,
        /*[in]*/ ToolTexLoader::TexData& data);

    //--------------------------------------------------------------------------
    /// バッファ作成(DX12)
    ///
    /// \param[in] gfx          グラフィック処理の参照先
    /// \param[in] data         テクスチャのデータ
    ///
    /// \return void
    //--------------------------------------------------------------------------
    void CreateBufferDX12(
        /*[in]*/ GfxMain& gfx,
        /*[in]*/ ToolTexLoader::TexData& data);

    //--------------------------------------------------------------------------

    //--------------------------------------------------------------------------
    Microsoft::WRL::ComPtr<ID3D11ShaderResourceView> m_pTextureView;
    Microsoft::WRL::ComPtr<ID3D12Resource> m_pTextureBuffer;
    GfxHeapMgr& m_heapMgr;
    UINT m_slot;
    //--------------------------------------------------------------------------

    /// <summary>
    /// m_pTextureView      SRVのポインタ
    /// m_pTextureBuffer    テクスチャバッファのポインタ
    /// m_heapMgr           ヒープマネージャの参照
    /// m_slot              入力スロット
    /// </summary>
};
