//==============================================================================
// Filename: Gfx_HeapMgr.h
// Description: ヒープマネージャ
// Copyright (C) 2022 Silicon Studio Co., Ltd. All rights reserved.
//==============================================================================

#pragma once

//===== インクルード部 =====
#include <Gfx/Binder/Gfx_Binder.h>
#include <Tool/Tool_TexLoader.h>

//===== クラス定義 =====

//***** テクスチャ *****
class GfxHeapMgr : public GfxBinder
{
    //--------------------------------------------------------------------------
    friend class GfxTexture;

    template<typename C>
    friend class GfxConstantBuffer;
    //--------------------------------------------------------------------------

public:

    //--------------------------------------------------------------------------

    //--------------------------------------------------------------------------
    /// コンストラクタ
    ///
    /// \param[in] gfx          グラフィック処理の参照先
    /// \param[in] bufferNum    バッファ作成数
    /// \param[in] pRef         自身のポインタ
    ///
    /// \return void
    //--------------------------------------------------------------------------
    GfxHeapMgr(
        /*[in]*/ GfxMain& gfx,
        /*[in]*/ UINT bufferNum,
        /*[in]*/ GfxHeapMgr* pRef);

    //--------------------------------------------------------------------------
    /// デストラクタ
    ///
    /// \return void
    //--------------------------------------------------------------------------
    ~GfxHeapMgr() noexcept override;

    //--------------------------------------------------------------------------
    /// バインド処理
    ///
    /// \param[in] gfx  グラフィック処理の参照先
    ///
    /// \return void
    //--------------------------------------------------------------------------
    void Bind(
        /*[in]*/ GfxMain& gfx) noexcept override;    //バインド処理

    //--------------------------------------------------------------------------

protected:

    //--------------------------------------------------------------------------
    Microsoft::WRL::ComPtr<ID3D12DescriptorHeap> m_pBufferHeaps;
    std::vector<D3D12_CPU_DESCRIPTOR_HANDLE> m_ahCPU;
    std::vector<D3D12_GPU_DESCRIPTOR_HANDLE> m_ahGPU;
    //--------------------------------------------------------------------------

    /// <summary>
    /// m_pBufferHeaps  バッファ用ヒープ
    /// m_ahCPU         ヒープハンドル(CPU)
    /// m_ahGPU         ヒープハンドル(GPU)
    /// </summary>
};
