//==============================================================================
// Filename: Win_ErrorOutput.h
// Description: エラー出力
// Copyright (C) 2022 Silicon Studio Co., Ltd. All rights reserved.
//==============================================================================

#pragma once

//===== インクルード部 =====
#include <Win/Win_Framework.h>
#include <exception>            //例外処理

//===== クラス定義 =====

//***** エラー出力 *****
class WinErrorOutput : public std::exception
{
public:

    //--------------------------------------------------------------------------

    //--------------------------------------------------------------------------
    /// コンストラクタ
    ///
    /// \param[in] nLine    エラーの発生位置（何行目）
    /// \param[in] chFile   エラーが発生したファイル名
    ///
    /// \return void
    //--------------------------------------------------------------------------
    WinErrorOutput(
        /*[in]*/ int nLine,
        /*[in]*/ const char* chFile) noexcept;

    //--------------------------------------------------------------------------
    /// デストラクタ
    ///
    /// \return void
    //--------------------------------------------------------------------------
    ~WinErrorOutput() noexcept override;

    //--------------------------------------------------------------------------
    /// エラータイプ取得
    ///
    /// \return エラータイプの文字列
    //--------------------------------------------------------------------------
    virtual const char* GetErrorType() const noexcept;

    //--------------------------------------------------------------------------
    /// エラー情報取得
    ///
    /// \return エラー情報の文字列
    //--------------------------------------------------------------------------
    std::string GetErrorInfo() const noexcept;

    //--------------------------------------------------------------------------
    /// エラー情報出力
    ///
    /// \return まとめたエラー情報の文字列
    //--------------------------------------------------------------------------
    const char* what() const noexcept override;

    //--------------------------------------------------------------------------

private:

    //--------------------------------------------------------------------------
    int m_line;
    std::string m_file;
    //--------------------------------------------------------------------------

    /// <summary>
    /// m_line  エラーの発生位置（何行目）
    /// m_file  エラーが発生したファイル名
    /// </summary>

protected:

    //--------------------------------------------------------------------------
    mutable std::string m_infoBuffer;
    //--------------------------------------------------------------------------

    /// <summary>
    /// m_infoBuffer    エラー情報格納用バッファ
    /// </summary>
};
